app/Controllers/Users.php

    public function index()
    {
        $userModel = new UserModel();

        $users = $userModel->findAll();
---
SELECT *
FROM `users`

    public function create()
    {
        $rules = [
            'username' => 'required|is_unique[users.username]',
            'full_name' => 'required'
        ];

        if (! $this->validate($rules)) {
            return redirect()->back()->withInput();
        }

        $userModel = new UserModel();

        $data = [
            'username' => $this->request->getPost('username'),
            'full_name' => $this->request->getPost('full_name'),
            'created_at' => date('Y-m-d H:i:s')
        ];

        $userModel->insert($data);
---
INSERT INTO `users` (`username`, `full_name`, `created_at`) VALUES ('testuser', 'Test User', '2026-10-01 02:55:33')

    public function edit($id)
    {
        $userModel = new UserModel();

        $user = $userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '4'

            $data['avatar'] = $newName;
        }

        $userModel->update($id, $data);
---
UPDATE `users` SET `username` = 'testuser', `full_name` = 'Updated Test User'
WHERE `users`.`id` IN ('4')